/*
const a = [1, 2, 3, 4, 5, 6];
const b = ['a', 'b', 'c', 'e'];

a.push(7, 8); // Добавляет элементы в конец массива
b.push('d');

a.pop(); // Удаляет последний элемент массива (не имеет параметров)
console.log(b.pop()); // Удаляет и возвращает последний элемент

delete a[3]; // Удаляет выбранный элемент массива и оставляет пропуск empty

a.splice(3, 3); // Удаляет, начиная с третьего, 3 элемента
a.splice(3, 3, 'test') // Удаляет 3 элемента начиная с третьего и добавляет "test"
*/
// shift() unshift() Добавляет и удаляет эл в начале массива



